:PROPERTIES:
:ID:       b4c096ee-6e40-4f34-85a1-7fc901e819f5
:END:
#+TITLE: Python
#+DESCRIPTION: python stuff
#+TAGS:

*** Dictionaries

Merge operator

#+begin_src python :results value verbatim
stftparam = {
    'hop_length': 512,
    'n_fft': 2048
}

specparam = {
    'x_axis': 'time',
    'y_axis': 'log'
}

# also stftparam |= specparam
return stftparam | specparam
#+end_src

#+RESULTS:
: {'hop_length': 512, 'n_fft': 2048, 'x_axis': 'time', 'y_axis': 'log'}

**** OpenSSL errors with =pyenv=

Ensure the python is building in OpenSSL support.

Ben Mezger installs python versions like so [[https://github.com/benmezger/dotfiles/blob/main/Makefile#L162-L177][in this Makefile]]

#+begin_example shell
PATH="$(HOME)/.pyenv/bin:${PATH}"; \
CFLAGS=-I/usr/include/openssl LDFLAGS=-L/usr/lib pyenv install -s 3.10.2; \
CFLAGS=-I/usr/include/openssl LDFLAGS=-L/usr/lib pyenv install -s 3.8.12; \
CFLAGS=-I/usr/include/openssl LDFLAGS=-L/usr/lib pyenv install -s 3.9.9; \
CFLAGS=-I/usr/include/openssl LDFLAGS=-L/usr/lib pyenv install -s 3.11.0; \

eval $(pyenv init -)
pip install --upgrade -r scripts/requirements.txt
#+end_example

From [[https://stackoverflow.com/questions/37055420/python-how-can-i-tell-if-my-python-has-ssl][s/o How can I tell if my python has SSL?]]

Test for openssl with =openssl rand -hex 20= and the installed python with:

#+begin_src shell
pyenv shell 3.11.3
python -c "import ssl; print(ssl.OPENSSL_VERSION)"
#+end_src

#+RESULTS:
: OpenSSL 3.0.8 7 Feb 2023

